# Bhaskar-NET configuration (8.93M parameters, 28.4 GFLOPs)
nc: 10 # Number of classes (e.g. VisDrone has 10 classes)

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]              # 1-P2/4
  - [-1, 3, TuaBottleneck, [32, 32, True]]  # 2-P2/4
  - [-1, 1, Conv, [64, 3, 2]]              # 3-P3/8
  - [-1, 6, TuaBottleneck, [64, 64, True]]  # 4-P3/8
  - [-1, 1, Conv, [128, 3, 2]]             # 5-P4/16
  - [-1, 6, TuaBottleneck, [128, 128, True]]# 6-P4/16
  - [-1, 1, Conv, [256, 3, 2]]             # 7-P5/32
  - [-1, 3, TuaBottleneck, [256, 256, True]]# 8-P5/32
  - [-1, 1, SPPF, [256, 5]]                # 9-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 3, C2f, [128]]                    # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [64]]                     # 15-P3/8

  - [12, 1, nn.Upsample, [None, 2, 'nearest']] # 16 (P4 upsampled)
  - [9, 1, nn.Upsample, [None, 4, 'nearest']]  # 17 (P5 upsampled)

  # Concat P3(15), P4_up(16), P5_up(17)
  - [[15, 16, 17], 1, Concat, [1]]        # 18
  - [-1, 1, Scalseq, [64, 128, 256]]       # 19 (Cross-Scale fusion)
  - [-1, 1, Zoomcat, [64]]                 # 20 (Spatial Multi-Zoom fusion)

  # Channel Normalization (forces 64 output channels for Detect input)
  - [12, 1, Conv, [64, 1, 1]]              # 21
  - [9, 1, Conv, [64, 1, 1]]               # 22

  # Detection Head taking 64-channel inputs from layers 20, 21, and 22
  - [[20, 21, 22], 1, Detect, [nc]]        # 23
